<template>
  <div class="read">
    <!--顶部导航栏-->
    <Head></Head>
    <!--内容-->
    <div class="read-content">
      测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据
      测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据
      测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据
      测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据
      测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据测试数据！！测试数据
    </div>
    <!--目录-->
    <div class="read-menu"></div>
    <!--底部设置。。。-->
    <div class="read-foot">
      <a href="#">
        <span>1</span>
        <h3>目录</h3>
      </a>
      <a href="#">
        <span>2</span>
        <h3>进度</h3>
      </a>
      <a href="#">
        <span>3</span>
        <h3>设置</h3>
      </a>
      <a href="#">
        <span>4</span>
        <h3>夜间</h3>
      </a>
    </div>
  </div>
</template>

<script>
import head from "../components/head";
export default {
  components: {
    Head: head
  }
};
</script>

<style scoped>
.read {
  background-color: #c4b395;
}
.head {
  background-color: rgba(0, 0, 0, 0.9);
  color: #fff;
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
}
.read >>> .head-left .icon {
  color: #fff;
}
.read-content {
  padding: 0 0.75rem;
}
.read-foot {
  display: flex;
  left: 0;
  bottom: 0;
  width: 100%;
  position: fixed;
  justify-content: space-between;
  background-color: rgba(0, 0, 0, 0.9);
}
.read-foot > a {
  display: block;
  font-size: 14px;
  font-weight: 0;
  padding-top: 0.375rem;
  width: 100%;
  color: #fff;
}
.read-foot > a > h3 {
    transform: scale(.7)
}
</style>